Creates empty analysis results primitive not associated with any geometry element
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public int AddSpatialFieldPrimitive()
  Visual Basic
Public Function AddSpatialFieldPrimitive As Integer
  Visual C++
public:
int AddSpatialFieldPrimitive()
 Return Value
 Unique index of primitive for future references
 See Also
  SpatialFieldManager Class
  AddSpatialFieldPrimitive Overload
  Autodesk.Revit.DB.Analysis Namespace